import { Head } from '../../../components/head/Head';
import styles from './Biography.module.scss';
import { useInView } from 'react-intersection-observer';

export const Biography = () => {
    const { ref: textImgRef, inView: textImgVisible } = useInView({
        triggerOnce: true,
        threshold: 1,
    });
    const { ref: imgTextRef, inView: imgTextVisible } = useInView({
        triggerOnce: true,
        threshold: 0.1,
    });

    return (
        <div className={styles.container}>
            <Head head="АБДУЛЛА МАЪДИЕВ ҲАҚИДА" />
            <div className={styles.textImg} ref={textImgRef}>
                {textImgVisible && (
                    <p className={textImgVisible && styles.leftAnime}>
                        Маъдиев Абдулла Зикрулло ўғли,&nbsp;
                        <span>1948 йилнинг 14 апрелида</span>&nbsp; Тошкент
                        вилояти Оққўрғон тумани Аччи қишлоғида таваллуд топган.
                        <br /> Ўзбек, олий маълумотли журналист. «Антик
                        дунё»(«Antique World») Халқаро Илмий Академиясининг
                        профессори.
                        <br />
                        <br />У <span>1966 йилда</span> 3-ўрта таълим мактабини
                        тамомлагач, Тошкентдаги Ўзбекистон Миллий
                        университетининг журналистика куллиётига ўқишга кириб,
                        уни 1972 йилда муваффақиятли тугатди.
                        <br />
                        <br /> А.З. Маъдиев иш фаолиятини
                        <span>&nbsp;1966 йилда</span>
                        &nbsp;«Гулистон» ширкат хўжалигида бошқарув котиблигидан
                        бошлаган. 1968—1970 йилларда 1, 4 - ўрта таълим
                        мактабларида тарбиячи, бош етакчи, 1970—1972 йилларда
                        Оққўрғон туман газетаси таҳририяти қошида
                        радио-ташкилотчи, 1972—1974 йилларда туман комсомол
                        қўмитаси ташкилий ишлар бўлими мудири, туман комсомол
                        қўмитаси котиби, 1974—1977 йилларда туман партия
                        қўмитасида йўриқчи бўлиб ишлаган.
                        <br />
                        <br />
                        <span>1977 йилда</span> «Озод» ширкат хўжалиги партком
                        секретари лавозимига сайланади. 1980 йилда «Озод» ва
                        «Партия XXII съезди» ширкат хўжаликлари қўшилгандан
                        кейин яна туман партия қўмитасида йўриқчи бўлиб ишлайди.
                    </p>
                )}
                {textImgVisible && (
                    <img
                        src="img/Abdulla/1.png"
                        className={textImgVisible && styles.rightAnime}
                        alt="abdulla"
                    />
                )}
            </div>
            <div className={styles.imgText} ref={imgTextRef}>
                {imgTextVisible && (
                    <img
                        src="img/Abdulla/2.png"
                        className={imgTextVisible && styles.leftAnime}
                        alt="abdulla"
                    />
                )}
                {imgTextVisible && (
                    <p className={imgTextVisible && styles.rightAnime}>
                        <span>1980 йилдан</span> туман ижроия қўмитасига маъсул
                        котибликка сайланади ва бу лавозимда 1988 йилгача
                        ишлайди.
                        <br />
                        <br />
                        <span>1988 йил 18 июнда</span> туман партия қўмитасининг
                        Пленумида алтернатив сайловда туман «Мўл ҳосил учун»
                        газетаси муҳаррири лавозимига сайланади.
                        <br />
                        <br /> А.З.Маъдиев уста раҳбар, моҳир журналист. У
                        раҳбар бўлиб келгач, газетанинг мазмуни ҳам, кўриниши
                        ҳам мутлақо ўзгарди. Таҳририят ўз компьютерига эга
                        бўлди. Бинолар капитал таъмирдан чиқарилди, хизмат
                        машинасига эга бўлди. Таҳририят иқтисодий инқироздан
                        чиқди.
                        <br />
                        <br /> А.З.Маъдиев узоқни кўра биладиган, жамиятдаги
                        ўзгаришларни тез сеза оладиган раҳбар. У
                        <span>1990 йиллардаёқ</span>
                        Мустақилликнинг шаббодаларини сезган эди. Республикада
                        бирорта газетанинг номи ўзгармаган бир пайтда Абдулла
                        Маъдиевнинг саъй-ҳаракати туфайли «Мўл ҳосил учун»
                        газетаси 1991 йилнинг 1 январидан «Оққўрғон овози» номи
                        билан чоп этила бошланди.
                        <br />
                        <br /> Абдулла Маъдиев <span>
                            1840—1912 йилларда
                        </span>{' '}
                        яшаб ижод этган аллома шоир Юсуф Сарёмийнинг чевараси.
                        Ижодкорнинг «Умрим зарварақлари», «Зулматдан зиё», «Етти
                        ота», «Бобом – фахрим менинг», «Муҳаббат юракда туғилар
                        шундай», «Қолаётган излар», Мустақиллигимизнинг 24
                        йиллигига бағишланган «Ватан ширин», “Бундай гўзал Ватан
                        яна қайда бор” номли китоблари чоп этилган.
                    </p>
                )}
            </div>
        </div>
    );
};
